{
    "references":[
        {
            "id": 0,
            "name": "PGA Profile Picture",
            "link": "https://github.com/PGA-dev/personalport/blob/main/src/app/resources/profile.png",
            "linkText": "PGA Profile Picture",
            "message": "Taken 2012 by J. Bedient"
        },
        {
            "id": 1,
            "name": "Abstract Blue And White",
            "link": "https://github.com/PGA-dev/personalport/blob/main/src/app/peter-olexa-01mFm_giy38-unsplash.jpg",
            "linkText": "Blue and White Abstract",
            "message": "Taken by Peter Olexa, courtesy of Unsplash.com"
        },
        {
            "id": 2,
            "name": "White Clouds",
            "link": "https://github.com/PGA-dev/personalport/blob/main/src/app/k-k-RnPuMyvPtss-unsplash.jpg",
            "linkText": "White Clouds during Daytime",
            "message": "Picture by K K, courtesy of Unsplash.com"
        },
        {
            "id": 3,
            "name": "Wavy blue",
            "link": "https://github.com/PGA-dev/personalport/blob/main/src/app/resources/marek-piwnicki-w4sxddUJ5-0-unsplash.jpg",
            "linkText": "Abstract smokey blue",
            "message": "Picture by Marek Piwnicki, courtesy of Unsplash.com"
        },
        {
            "id": 4,
            "name": "Cyntler React-Doc-Viewer",
            "link": "https://www.npmjs.com/package/@cyntler/react-doc-viewer",
            "linkText": "React doc viewer",
            "message": "Used Cyntler's viewer to render simple docx files for resume page..."
        }, 
        {
            "id": 5,
            "name": "How to create a responsive HTML table",
            "link": "https://www.youtube.com/watch?v=czZ1PvNW5hk",
            "linkText": "Kevin Powell's Responsive Table YouTube Video",
            "message": "Kevin's video was especially helpful in practically adressing the responsive mobile design...modified of course." 
        },
        {
            "id": 6,
            "name": "A Responsive Accessible Table",
            "link": "https://adrianroselli.com/2017/11/a-responsive-accessible-table.html",
            "linkText": "Adrian Roselli's responsive design",
            "message": "Used some of Adrian Roselli's ideas for how to scale table rows and spacing."
        }
    ],

    "history":
    [
        {
            "id": 0,
            "name1": "PGA",
            "name2": "(Paul Gene Adam)",
            "first": "I will start from the beginning...first the earth cooled, then the dinosaurs came, but they got too big and fat and all died... ('Airplane', 1977)...I jest...Maybe not a solid idea going quite that far back. ",
            "second": "Hello, and thank you for taking a gander at my personal and professional profile. I am Paul Gene Adam, or for short...PGA. I began my career in software as a network administrator and hardware technician, moving slowly into the realm of software testing and development over time. Originally, I built developer desktop computers, along with Xen, VMWare servers farms, and basic network and print server applications for Resource Data. So for the start of my professional IT life I was learning AD DS, Exchange servers, MS task scripting and network security. In a fluke testing outing I did for the Army Reserve here in Boise, through RDI, I stood out as a having a knack for logical observation, and analysis; this led to me becoming a regular tester for the Boise branch, and even some mild HTML/CSS/JS dev tasks on regular client projects. My original software training and experience was primarily in C# .Net programming and MSSQL; a result of being relied upon for testing and front end dev work on previous client edeavors.  Early in my academic life I graduated with a BA in Philosophy, and an MA in Social Science Sociology; my passion for problem-solving, symbolic logical analysis skills, statistical tool use, such as SPSS, and love of analysis was cultivated during both programs. Most recently, I graduated with triple honors from NuCamp, utilizing their online fullstack bootcamp to learn React, React Native, Python, and brush up on my SQL skills. I am currently a fullstack developer with my main focus in React-based development.",
            "third": "I still enjoy building computers, and customizing network applications around my own home, but largely am very satisfied using my dev laptop over my earlier gaming systems as we all age out of the tower computer era, towards the plug-and-play generation. In days gone by, I was a pretty serious gamer, mostly computer, or platform (xbox), but rarely find a lot of time to play anymore. Likewise, I try to keep my phone as a tool, and not a gaming platform, but am not always 100% successful. A former guitar teacher, professional player, and guitar parts salesman, I try to make music a serious part of my life wherever I go. I also do some mild work on instruments, mostly electric guitar and bass, but find software development, or playing music, requires most of my time previously occupied by guitar building.  I also sing, after finishing KTVA (Ken Tamplin's vocal academy) and play a pretty remedial piano. I am a very bad golfer, about a 14 hdcp when I was serious; mostly known to squirrels as tree killer...lol. A great many years ago, during my 20's, I was an open-classed billiard player, and a serious poker player; I have always assumed these spurious activites, lol,  probably were where I developed my interest in social analysis and negotiation. As for pool playing, I would like to get back to this a bit, at some time, but only once I can afford to buy a house and invest in a game room. Currently, I find myself getting far more interested in building web applications for some of my former hobbies; my Front End, and Full Stack Honors projects were both focused upon guitar based musical applications; basically, buying guides for the modern player.",
            "close": "Make sure you check out my education, project and resume pages for more details, and thanks for stopping by.  PGA"
        }
    ]
}